; domain
(define (domain emergencia)
  (:requirements :strips :typing)

  (:types
    location
    person
    crate
    content
    drone
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (has-content ?c - crate ?con - content)
    (has ?p - person ?con - content)

    (free-arm1 ?d - drone)
    (free-arm2 ?d - drone)

    (carrying-arm1 ?d - drone ?c - crate)
    (carrying-arm2 ?d - drone ?c - crate)

    (available ?c - crate)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition
      (at-drone ?d ?from)
    :effect
      (and
        (not (at-drone ?d ?from))
        (at-drone ?d ?to)
      )
  )

  (:action pickup-arm1
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm1 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm1 ?d))
        (not (available ?c))
        (carrying-arm1 ?d ?c)
      )
  )

  (:action pickup-arm2
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm2 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm2 ?d))
        (not (available ?c))
        (carrying-arm2 ?d ?c)
      )
  )

  (:action deliver-arm1
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm1 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm1 ?d ?c))
        (free-arm1 ?d)
        (has ?p ?con)
      )
  )

  (:action deliver-arm2
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm2 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm2 ?d ?c))
        (free-arm2 ?d)
        (has ?p ?con)
      )
  )
)

; problem
(define (problem drone_problem_d1_r0_l37_p37_c37_g37_ct2)
(:domain emergencia)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	loc34 - location
	loc35 - location
	loc36 - location
	loc37 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	crate34 - crate
	crate35 - crate
	crate36 - crate
	crate37 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
	person36 - person
	person37 - person
)
(:init
	(at-drone drone1 depot)
	(free-arm1 drone1)
	(free-arm2 drone1)
	(at-crate crate1 depot)
	(available crate1)
	(at-crate crate2 depot)
	(available crate2)
	(at-crate crate3 depot)
	(available crate3)
	(at-crate crate4 depot)
	(available crate4)
	(at-crate crate5 depot)
	(available crate5)
	(at-crate crate6 depot)
	(available crate6)
	(at-crate crate7 depot)
	(available crate7)
	(at-crate crate8 depot)
	(available crate8)
	(at-crate crate9 depot)
	(available crate9)
	(at-crate crate10 depot)
	(available crate10)
	(at-crate crate11 depot)
	(available crate11)
	(at-crate crate12 depot)
	(available crate12)
	(at-crate crate13 depot)
	(available crate13)
	(at-crate crate14 depot)
	(available crate14)
	(at-crate crate15 depot)
	(available crate15)
	(at-crate crate16 depot)
	(available crate16)
	(at-crate crate17 depot)
	(available crate17)
	(at-crate crate18 depot)
	(available crate18)
	(at-crate crate19 depot)
	(available crate19)
	(at-crate crate20 depot)
	(available crate20)
	(at-crate crate21 depot)
	(available crate21)
	(at-crate crate22 depot)
	(available crate22)
	(at-crate crate23 depot)
	(available crate23)
	(at-crate crate24 depot)
	(available crate24)
	(at-crate crate25 depot)
	(available crate25)
	(at-crate crate26 depot)
	(available crate26)
	(at-crate crate27 depot)
	(available crate27)
	(at-crate crate28 depot)
	(available crate28)
	(at-crate crate29 depot)
	(available crate29)
	(at-crate crate30 depot)
	(available crate30)
	(at-crate crate31 depot)
	(available crate31)
	(at-crate crate32 depot)
	(available crate32)
	(at-crate crate33 depot)
	(available crate33)
	(at-crate crate34 depot)
	(available crate34)
	(at-crate crate35 depot)
	(available crate35)
	(at-crate crate36 depot)
	(available crate36)
	(at-crate crate37 depot)
	(available crate37)
	(has-content crate1 food)
	(has-content crate2 food)
	(has-content crate3 food)
	(has-content crate4 food)
	(has-content crate5 food)
	(has-content crate6 food)
	(has-content crate7 food)
	(has-content crate8 food)
	(has-content crate9 food)
	(has-content crate10 food)
	(has-content crate11 food)
	(has-content crate12 food)
	(has-content crate13 food)
	(has-content crate14 food)
	(has-content crate15 food)
	(has-content crate16 food)
	(has-content crate17 food)
	(has-content crate18 food)
	(has-content crate19 food)
	(has-content crate20 food)
	(has-content crate21 food)
	(has-content crate22 food)
	(has-content crate23 food)
	(has-content crate24 food)
	(has-content crate25 food)
	(has-content crate26 medicine)
	(has-content crate27 medicine)
	(has-content crate28 medicine)
	(has-content crate29 medicine)
	(has-content crate30 medicine)
	(has-content crate31 medicine)
	(has-content crate32 medicine)
	(has-content crate33 medicine)
	(has-content crate34 medicine)
	(has-content crate35 medicine)
	(has-content crate36 medicine)
	(has-content crate37 medicine)
	(at-person person1 loc30)
	(at-person person2 loc6)
	(at-person person3 loc22)
	(at-person person4 loc3)
	(at-person person5 loc35)
	(at-person person6 loc18)
	(at-person person7 loc9)
	(at-person person8 loc16)
	(at-person person9 loc31)
	(at-person person10 loc23)
	(at-person person11 loc19)
	(at-person person12 loc23)
	(at-person person13 loc9)
	(at-person person14 loc20)
	(at-person person15 loc25)
	(at-person person16 loc27)
	(at-person person17 loc6)
	(at-person person18 loc1)
	(at-person person19 loc13)
	(at-person person20 loc22)
	(at-person person21 loc11)
	(at-person person22 loc16)
	(at-person person23 loc15)
	(at-person person24 loc29)
	(at-person person25 loc25)
	(at-person person26 loc37)
	(at-person person27 loc27)
	(at-person person28 loc3)
	(at-person person29 loc26)
	(at-person person30 loc37)
	(at-person person31 loc27)
	(at-person person32 loc3)
	(at-person person33 loc11)
	(at-person person34 loc29)
	(at-person person35 loc5)
	(at-person person36 loc17)
	(at-person person37 loc11)
)
(:goal (and
	(at-drone drone1 depot)
	(has person2 food)
	(has person3 food)
	(has person3 medicine)
	(has person5 food)
	(has person6 food)
	(has person6 medicine)
	(has person7 food)
	(has person7 medicine)
	(has person8 medicine)
	(has person10 food)
	(has person11 food)
	(has person11 medicine)
	(has person12 food)
	(has person13 food)
	(has person14 food)
	(has person14 medicine)
	(has person15 food)
	(has person15 medicine)
	(has person16 food)
	(has person17 food)
	(has person18 food)
	(has person18 medicine)
	(has person19 food)
	(has person22 food)
	(has person24 food)
	(has person25 medicine)
	(has person26 food)
	(has person28 food)
	(has person29 food)
	(has person31 food)
	(has person32 medicine)
	(has person34 food)
	(has person34 medicine)
	(has person35 food)
	(has person36 food)
	(has person36 medicine)
	(has person37 food)
	))
)

; plan
1. (pickup-arm2 drone1 crate37 depot)
   deleted: (at-crate crate37 depot) (free-arm2 drone1) (available crate37)
   added: (carrying-arm2 drone1 crate37)
   goals met: 1 of 38
2. (pickup-arm1 drone1 crate25 depot)
   deleted: (at-crate crate25 depot) (free-arm1 drone1) (available crate25)
   added: (carrying-arm1 drone1 crate25)
   goals met: 1 of 38
3. (fly drone1 depot loc37)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc37)
   goals met: 0 of 38
4. (deliver-arm1 drone1 crate25 person26 food loc37)
   deleted: (carrying-arm1 drone1 crate25)
   added: (free-arm1 drone1) (has person26 food)
   goals met: 1 of 38
5. (fly drone1 loc37 depot)
   deleted: (at-drone drone1 loc37)
   added: (at-drone drone1 depot)
   goals met: 2 of 38
6. (pickup-arm1 drone1 crate24 depot)
   deleted: (at-crate crate24 depot) (free-arm1 drone1) (available crate24)
   added: (carrying-arm1 drone1 crate24)
   goals met: 2 of 38
7. (fly drone1 depot loc35)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc35)
   goals met: 1 of 38
8. (deliver-arm1 drone1 crate24 person5 food loc35)
   deleted: (carrying-arm1 drone1 crate24)
   added: (free-arm1 drone1) (has person5 food)
   goals met: 2 of 38
9. (fly drone1 loc35 depot)
   deleted: (at-drone drone1 loc35)
   added: (at-drone drone1 depot)
   goals met: 3 of 38
10. (pickup-arm1 drone1 crate23 depot)
   deleted: (at-crate crate23 depot) (free-arm1 drone1) (available crate23)
   added: (carrying-arm1 drone1 crate23)
   goals met: 3 of 38
11. (fly drone1 depot loc26)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc26)
   goals met: 2 of 38
12. (deliver-arm1 drone1 crate23 person29 food loc26)
   deleted: (carrying-arm1 drone1 crate23)
   added: (free-arm1 drone1) (has person29 food)
   goals met: 3 of 38
13. (fly drone1 loc26 depot)
   deleted: (at-drone drone1 loc26)
   added: (at-drone drone1 depot)
   goals met: 4 of 38
14. (pickup-arm1 drone1 crate22 depot)
   deleted: (at-crate crate22 depot) (free-arm1 drone1) (available crate22)
   added: (carrying-arm1 drone1 crate22)
   goals met: 4 of 38
15. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 3 of 38
16. (deliver-arm1 drone1 crate22 person19 food loc13)
   deleted: (carrying-arm1 drone1 crate22)
   added: (free-arm1 drone1) (has person19 food)
   goals met: 4 of 38
17. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 5 of 38
18. (pickup-arm1 drone1 crate21 depot)
   deleted: (at-crate crate21 depot) (free-arm1 drone1) (available crate21)
   added: (carrying-arm1 drone1 crate21)
   goals met: 5 of 38
19. (fly drone1 depot loc11)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc11)
   goals met: 4 of 38
20. (deliver-arm1 drone1 crate21 person37 food loc11)
   deleted: (carrying-arm1 drone1 crate21)
   added: (free-arm1 drone1) (has person37 food)
   goals met: 5 of 38
21. (fly drone1 loc11 depot)
   deleted: (at-drone drone1 loc11)
   added: (at-drone drone1 depot)
   goals met: 6 of 38
22. (pickup-arm1 drone1 crate20 depot)
   deleted: (at-crate crate20 depot) (free-arm1 drone1) (available crate20)
   added: (carrying-arm1 drone1 crate20)
   goals met: 6 of 38
23. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 5 of 38
24. (deliver-arm1 drone1 crate20 person35 food loc5)
   deleted: (carrying-arm1 drone1 crate20)
   added: (free-arm1 drone1) (has person35 food)
   goals met: 6 of 38
25. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 7 of 38
26. (pickup-arm1 drone1 crate19 depot)
   deleted: (at-crate crate19 depot) (free-arm1 drone1) (available crate19)
   added: (carrying-arm1 drone1 crate19)
   goals met: 7 of 38
27. (fly drone1 depot loc29)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc29)
   goals met: 6 of 38
28. (deliver-arm2 drone1 crate37 person34 medicine loc29)
   deleted: (carrying-arm2 drone1 crate37)
   added: (free-arm2 drone1) (has person34 medicine)
   goals met: 7 of 38
29. (fly drone1 loc29 depot)
   deleted: (at-drone drone1 loc29)
   added: (at-drone drone1 depot)
   goals met: 8 of 38
30. (pickup-arm2 drone1 crate36 depot)
   deleted: (at-crate crate36 depot) (free-arm2 drone1) (available crate36)
   added: (carrying-arm2 drone1 crate36)
   goals met: 8 of 38
31. (fly drone1 depot loc29)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc29)
   goals met: 7 of 38
32. (deliver-arm1 drone1 crate19 person24 food loc29)
   deleted: (carrying-arm1 drone1 crate19)
   added: (free-arm1 drone1) (has person24 food)
   goals met: 8 of 38
33. (fly drone1 loc29 depot)
   deleted: (at-drone drone1 loc29)
   added: (at-drone drone1 depot)
   goals met: 9 of 38
34. (pickup-arm1 drone1 crate18 depot)
   deleted: (at-crate crate18 depot) (free-arm1 drone1) (available crate18)
   added: (carrying-arm1 drone1 crate18)
   goals met: 9 of 38
35. (fly drone1 depot loc29)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc29)
   goals met: 8 of 38
36. (deliver-arm1 drone1 crate18 person34 food loc29)
   deleted: (carrying-arm1 drone1 crate18)
   added: (free-arm1 drone1) (has person34 food)
   goals met: 9 of 38
37. (fly drone1 loc29 depot)
   deleted: (at-drone drone1 loc29)
   added: (at-drone drone1 depot)
   goals met: 10 of 38
38. (pickup-arm1 drone1 crate17 depot)
   deleted: (at-crate crate17 depot) (free-arm1 drone1) (available crate17)
   added: (carrying-arm1 drone1 crate17)
   goals met: 10 of 38
39. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 9 of 38
40. (deliver-arm1 drone1 crate17 person16 food loc27)
   deleted: (carrying-arm1 drone1 crate17)
   added: (free-arm1 drone1) (has person16 food)
   goals met: 10 of 38
41. (fly drone1 loc27 depot)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 depot)
   goals met: 11 of 38
42. (pickup-arm1 drone1 crate16 depot)
   deleted: (at-crate crate16 depot) (free-arm1 drone1) (available crate16)
   added: (carrying-arm1 drone1 crate16)
   goals met: 11 of 38
43. (fly drone1 depot loc27)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc27)
   goals met: 10 of 38
44. (deliver-arm1 drone1 crate16 person31 food loc27)
   deleted: (carrying-arm1 drone1 crate16)
   added: (free-arm1 drone1) (has person31 food)
   goals met: 11 of 38
45. (fly drone1 loc27 depot)
   deleted: (at-drone drone1 loc27)
   added: (at-drone drone1 depot)
   goals met: 12 of 38
46. (pickup-arm1 drone1 crate15 depot)
   deleted: (at-crate crate15 depot) (free-arm1 drone1) (available crate15)
   added: (carrying-arm1 drone1 crate15)
   goals met: 12 of 38
47. (fly drone1 depot loc25)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc25)
   goals met: 11 of 38
48. (deliver-arm2 drone1 crate36 person15 medicine loc25)
   deleted: (carrying-arm2 drone1 crate36)
   added: (free-arm2 drone1) (has person15 medicine)
   goals met: 12 of 38
49. (fly drone1 loc25 depot)
   deleted: (at-drone drone1 loc25)
   added: (at-drone drone1 depot)
   goals met: 13 of 38
50. (pickup-arm2 drone1 crate35 depot)
   deleted: (at-crate crate35 depot) (free-arm2 drone1) (available crate35)
   added: (carrying-arm2 drone1 crate35)
   goals met: 13 of 38
51. (fly drone1 depot loc25)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc25)
   goals met: 12 of 38
52. (deliver-arm2 drone1 crate35 person25 medicine loc25)
   deleted: (carrying-arm2 drone1 crate35)
   added: (free-arm2 drone1) (has person25 medicine)
   goals met: 13 of 38
53. (deliver-arm1 drone1 crate15 person15 food loc25)
   deleted: (carrying-arm1 drone1 crate15)
   added: (free-arm1 drone1) (has person15 food)
   goals met: 14 of 38
54. (fly drone1 loc25 depot)
   deleted: (at-drone drone1 loc25)
   added: (at-drone drone1 depot)
   goals met: 15 of 38
55. (pickup-arm2 drone1 crate34 depot)
   deleted: (at-crate crate34 depot) (free-arm2 drone1) (available crate34)
   added: (carrying-arm2 drone1 crate34)
   goals met: 15 of 38
56. (pickup-arm1 drone1 crate14 depot)
   deleted: (at-crate crate14 depot) (free-arm1 drone1) (available crate14)
   added: (carrying-arm1 drone1 crate14)
   goals met: 15 of 38
57. (fly drone1 depot loc23)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc23)
   goals met: 14 of 38
58. (deliver-arm1 drone1 crate14 person10 food loc23)
   deleted: (carrying-arm1 drone1 crate14)
   added: (free-arm1 drone1) (has person10 food)
   goals met: 15 of 38
59. (fly drone1 loc23 depot)
   deleted: (at-drone drone1 loc23)
   added: (at-drone drone1 depot)
   goals met: 16 of 38
60. (pickup-arm1 drone1 crate13 depot)
   deleted: (at-crate crate13 depot) (free-arm1 drone1) (available crate13)
   added: (carrying-arm1 drone1 crate13)
   goals met: 16 of 38
61. (fly drone1 depot loc23)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc23)
   goals met: 15 of 38
62. (deliver-arm1 drone1 crate13 person12 food loc23)
   deleted: (carrying-arm1 drone1 crate13)
   added: (free-arm1 drone1) (has person12 food)
   goals met: 16 of 38
63. (fly drone1 loc23 depot)
   deleted: (at-drone drone1 loc23)
   added: (at-drone drone1 depot)
   goals met: 17 of 38
64. (pickup-arm1 drone1 crate12 depot)
   deleted: (at-crate crate12 depot) (free-arm1 drone1) (available crate12)
   added: (carrying-arm1 drone1 crate12)
   goals met: 17 of 38
65. (fly drone1 depot loc22)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc22)
   goals met: 16 of 38
66. (deliver-arm2 drone1 crate34 person3 medicine loc22)
   deleted: (carrying-arm2 drone1 crate34)
   added: (free-arm2 drone1) (has person3 medicine)
   goals met: 17 of 38
67. (deliver-arm1 drone1 crate12 person3 food loc22)
   deleted: (carrying-arm1 drone1 crate12)
   added: (free-arm1 drone1) (has person3 food)
   goals met: 18 of 38
68. (fly drone1 loc22 depot)
   deleted: (at-drone drone1 loc22)
   added: (at-drone drone1 depot)
   goals met: 19 of 38
69. (pickup-arm2 drone1 crate33 depot)
   deleted: (at-crate crate33 depot) (free-arm2 drone1) (available crate33)
   added: (carrying-arm2 drone1 crate33)
   goals met: 19 of 38
70. (pickup-arm1 drone1 crate11 depot)
   deleted: (at-crate crate11 depot) (free-arm1 drone1) (available crate11)
   added: (carrying-arm1 drone1 crate11)
   goals met: 19 of 38
71. (fly drone1 depot loc20)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc20)
   goals met: 18 of 38
72. (deliver-arm2 drone1 crate33 person14 medicine loc20)
   deleted: (carrying-arm2 drone1 crate33)
   added: (free-arm2 drone1) (has person14 medicine)
   goals met: 19 of 38
73. (deliver-arm1 drone1 crate11 person14 food loc20)
   deleted: (carrying-arm1 drone1 crate11)
   added: (free-arm1 drone1) (has person14 food)
   goals met: 20 of 38
74. (fly drone1 loc20 depot)
   deleted: (at-drone drone1 loc20)
   added: (at-drone drone1 depot)
   goals met: 21 of 38
75. (pickup-arm2 drone1 crate32 depot)
   deleted: (at-crate crate32 depot) (free-arm2 drone1) (available crate32)
   added: (carrying-arm2 drone1 crate32)
   goals met: 21 of 38
76. (pickup-arm1 drone1 crate10 depot)
   deleted: (at-crate crate10 depot) (free-arm1 drone1) (available crate10)
   added: (carrying-arm1 drone1 crate10)
   goals met: 21 of 38
77. (fly drone1 depot loc19)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc19)
   goals met: 20 of 38
78. (deliver-arm2 drone1 crate32 person11 medicine loc19)
   deleted: (carrying-arm2 drone1 crate32)
   added: (free-arm2 drone1) (has person11 medicine)
   goals met: 21 of 38
79. (deliver-arm1 drone1 crate10 person11 food loc19)
   deleted: (carrying-arm1 drone1 crate10)
   added: (free-arm1 drone1) (has person11 food)
   goals met: 22 of 38
80. (fly drone1 loc19 depot)
   deleted: (at-drone drone1 loc19)
   added: (at-drone drone1 depot)
   goals met: 23 of 38
81. (pickup-arm2 drone1 crate31 depot)
   deleted: (at-crate crate31 depot) (free-arm2 drone1) (available crate31)
   added: (carrying-arm2 drone1 crate31)
   goals met: 23 of 38
82. (pickup-arm1 drone1 crate9 depot)
   deleted: (at-crate crate9 depot) (free-arm1 drone1) (available crate9)
   added: (carrying-arm1 drone1 crate9)
   goals met: 23 of 38
83. (fly drone1 depot loc18)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc18)
   goals met: 22 of 38
84. (deliver-arm2 drone1 crate31 person6 medicine loc18)
   deleted: (carrying-arm2 drone1 crate31)
   added: (free-arm2 drone1) (has person6 medicine)
   goals met: 23 of 38
85. (deliver-arm1 drone1 crate9 person6 food loc18)
   deleted: (carrying-arm1 drone1 crate9)
   added: (free-arm1 drone1) (has person6 food)
   goals met: 24 of 38
86. (fly drone1 loc18 depot)
   deleted: (at-drone drone1 loc18)
   added: (at-drone drone1 depot)
   goals met: 25 of 38
87. (pickup-arm2 drone1 crate30 depot)
   deleted: (at-crate crate30 depot) (free-arm2 drone1) (available crate30)
   added: (carrying-arm2 drone1 crate30)
   goals met: 25 of 38
88. (pickup-arm1 drone1 crate8 depot)
   deleted: (at-crate crate8 depot) (free-arm1 drone1) (available crate8)
   added: (carrying-arm1 drone1 crate8)
   goals met: 25 of 38
89. (fly drone1 depot loc17)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc17)
   goals met: 24 of 38
90. (deliver-arm2 drone1 crate30 person36 medicine loc17)
   deleted: (carrying-arm2 drone1 crate30)
   added: (free-arm2 drone1) (has person36 medicine)
   goals met: 25 of 38
91. (deliver-arm1 drone1 crate8 person36 food loc17)
   deleted: (carrying-arm1 drone1 crate8)
   added: (free-arm1 drone1) (has person36 food)
   goals met: 26 of 38
92. (fly drone1 loc17 depot)
   deleted: (at-drone drone1 loc17)
   added: (at-drone drone1 depot)
   goals met: 27 of 38
93. (pickup-arm2 drone1 crate29 depot)
   deleted: (at-crate crate29 depot) (free-arm2 drone1) (available crate29)
   added: (carrying-arm2 drone1 crate29)
   goals met: 27 of 38
94. (pickup-arm1 drone1 crate7 depot)
   deleted: (at-crate crate7 depot) (free-arm1 drone1) (available crate7)
   added: (carrying-arm1 drone1 crate7)
   goals met: 27 of 38
95. (fly drone1 depot loc16)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc16)
   goals met: 26 of 38
96. (deliver-arm2 drone1 crate29 person8 medicine loc16)
   deleted: (carrying-arm2 drone1 crate29)
   added: (free-arm2 drone1) (has person8 medicine)
   goals met: 27 of 38
97. (deliver-arm1 drone1 crate7 person22 food loc16)
   deleted: (carrying-arm1 drone1 crate7)
   added: (free-arm1 drone1) (has person22 food)
   goals met: 28 of 38
98. (fly drone1 loc16 depot)
   deleted: (at-drone drone1 loc16)
   added: (at-drone drone1 depot)
   goals met: 29 of 38
99. (pickup-arm2 drone1 crate28 depot)
   deleted: (at-crate crate28 depot) (free-arm2 drone1) (available crate28)
   added: (carrying-arm2 drone1 crate28)
   goals met: 29 of 38
100. (pickup-arm1 drone1 crate6 depot)
   deleted: (at-crate crate6 depot) (free-arm1 drone1) (available crate6)
   added: (carrying-arm1 drone1 crate6)
   goals met: 29 of 38
101. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 28 of 38
102. (deliver-arm2 drone1 crate28 person7 medicine loc9)
   deleted: (carrying-arm2 drone1 crate28)
   added: (free-arm2 drone1) (has person7 medicine)
   goals met: 29 of 38
103. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 30 of 38
104. (pickup-arm2 drone1 crate27 depot)
   deleted: (at-crate crate27 depot) (free-arm2 drone1) (available crate27)
   added: (carrying-arm2 drone1 crate27)
   goals met: 30 of 38
105. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 29 of 38
106. (deliver-arm1 drone1 crate6 person7 food loc9)
   deleted: (carrying-arm1 drone1 crate6)
   added: (free-arm1 drone1) (has person7 food)
   goals met: 30 of 38
107. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 31 of 38
108. (pickup-arm1 drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (free-arm1 drone1) (available crate5)
   added: (carrying-arm1 drone1 crate5)
   goals met: 31 of 38
109. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 30 of 38
110. (deliver-arm1 drone1 crate5 person13 food loc9)
   deleted: (carrying-arm1 drone1 crate5)
   added: (free-arm1 drone1) (has person13 food)
   goals met: 31 of 38
111. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 32 of 38
112. (pickup-arm1 drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (free-arm1 drone1) (available crate4)
   added: (carrying-arm1 drone1 crate4)
   goals met: 32 of 38
113. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 31 of 38
114. (deliver-arm1 drone1 crate4 person2 food loc6)
   deleted: (carrying-arm1 drone1 crate4)
   added: (free-arm1 drone1) (has person2 food)
   goals met: 32 of 38
115. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 33 of 38
116. (pickup-arm1 drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (free-arm1 drone1) (available crate3)
   added: (carrying-arm1 drone1 crate3)
   goals met: 33 of 38
117. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 32 of 38
118. (deliver-arm1 drone1 crate3 person17 food loc6)
   deleted: (carrying-arm1 drone1 crate3)
   added: (free-arm1 drone1) (has person17 food)
   goals met: 33 of 38
119. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 34 of 38
120. (pickup-arm1 drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (free-arm1 drone1) (available crate2)
   added: (carrying-arm1 drone1 crate2)
   goals met: 34 of 38
121. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 33 of 38
122. (deliver-arm2 drone1 crate27 person32 medicine loc3)
   deleted: (carrying-arm2 drone1 crate27)
   added: (free-arm2 drone1) (has person32 medicine)
   goals met: 34 of 38
123. (deliver-arm1 drone1 crate2 person28 food loc3)
   deleted: (carrying-arm1 drone1 crate2)
   added: (free-arm1 drone1) (has person28 food)
   goals met: 35 of 38
124. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 36 of 38
125. (pickup-arm2 drone1 crate26 depot)
   deleted: (at-crate crate26 depot) (free-arm2 drone1) (available crate26)
   added: (carrying-arm2 drone1 crate26)
   goals met: 36 of 38
126. (pickup-arm1 drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (free-arm1 drone1) (available crate1)
   added: (carrying-arm1 drone1 crate1)
   goals met: 36 of 38
127. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 35 of 38
128. (deliver-arm2 drone1 crate26 person18 medicine loc1)
   deleted: (carrying-arm2 drone1 crate26)
   added: (free-arm2 drone1) (has person18 medicine)
   goals met: 36 of 38
129. (deliver-arm1 drone1 crate1 person18 food loc1)
   deleted: (carrying-arm1 drone1 crate1)
   added: (free-arm1 drone1) (has person18 food)
   goals met: 37 of 38
130. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 38 of 38
